etc/OpenFOAM_Sample_Files/External CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletVelocity;
		#include		"ABLConditions"
    }

	walls
    {
		type            fixedValue;     //version 4 > type	noSlip;
        value           uniform (0 0 0);
    }

    ground
    {
      type            fixedValue;
	  value    	  uniform (0 0 0);
    }
	
	top
	{
        type            calculated;
        value           uniform 0;
	}
	
	rightSide
	{
        type            calculated;
        value           uniform 0;
	}

	leftSide
	{
        type            calculated;
        value           uniform 0;
	}
}


// ************************************************************************* //
