etc/OpenFOAM_Sample_Files/External CFD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{

    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
		#include		"ABLConditions"
    }

    ground
    {
        type            zeroGradient;
    }

	top
	{
		type		slip;
	}
	
	rightSide
	{
		type		slip;
	}

	leftSide
	{
		type		slip;
	}
	
}


// ************************************************************************* //
