etc/OpenFOAM_Sample_Files/External CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletK;
		#include        "ABLConditions"		
    }

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }
	
	top
	{
		type		slip;
	}
	
	rightSide
	{
		type		slip;
	}

	leftSide
	{
		type		slip;
	}

}


// ************************************************************************* //
