etc/OpenFOAM_Sample_Files/External CFD/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "ABLConditions"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    walls
    {
        type            nutkWallFunction;
        value           uniform 0.0;
    }

    ground
    {
        type            nutkAtmRoughWallFunction;
		#include 		"ABLConditions"				
		value           uniform 0;
    }

	top
	{
        type            calculated;
        value           uniform 0;
	}
	
	rightSide
	{
        type            calculated;
        value           uniform 0;
	}

	leftSide
	{
        type            calculated;
        value           uniform 0;
	}
}


// ************************************************************************* //
