etc/OpenFOAM_Sample_Files/External CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // default
	p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.1;			//high quality: 0.001
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;		//high quality: 1000
        mergeLevels      1;
    }

    U
    {
		type			 coupled;
        solver           PBiCCG;
		preconditioner   DILU;
        tolerance        (1e-6 1e-6 1e-6); // high quality (1e-8 1e-8 1e-8)
        relTol           (0.1 0.1 0.1);    // high quality (0 0 0)
        minIter          3;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;  //high quality 0.001
        nSweeps          1;
    }

    epsilon
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;   //high quality 0.001
        nSweeps          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1; // from check mesh (1 for the best, 4 for the worst category - the best in pdf is 2.)

    residualControl
    {
        p               1e-3;
        U               1e-4;
        "(k|epsilon)"   1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
    }
}

// ************************************************************************* //
